src/test/resources/templates/stripe/authorisation_success_response.json

{
  "id": "ch_1DRQ842eZvKYlo2CPbf7NNDv_test",
  "object": "charge",
  "amount": 100,
  "amount_refunded": 0,
  "application": null,
  "application_fee": null,
  "balance_transaction": "txn_19XJJ02eZvKYlo2ClwuJ1rbA",
  "captured": false,
  "created": 1541017048,
  "currency": "usd",
  "customer": null,
  "description": "My First Test Charge (created for API docs)",
  "destination": null,
  "dispute": null,
  "failure_code": null,
  "failure_message": null,
  "fraud_details": {
  },
  "invoice": null,
  "livemode": false,
  "metadata": {
  },
  "on_behalf_of": null,
  "order": null,
  "outcome": null,
  "paid": true,
  "payment_intent": null,
  "receipt_email": null,
  "receipt_number": null,
  "refunded": false,
  "refunds": {
    "object": "list",
    "data": [

    ],
    "has_more": false,
    "total_count": 0,
    "url": "/v1/charges/ch_1DRQ842eZvKYlo2CPbf7NNDv/refunds"
  },
  "review": null,
  "shipping": null,
  "source": {
    "id": "card_1DRQ7x2eZvKYlo2CXDB4fhwC",
    "object": "card",
    "address_city": "Pittsburgh",
    "address_country": "US",
    "address_line1": "414 Grant St",
    "address_line1_check": "pass",
    "address_line2": "",
    "address_state": "PA",
    "address_zip": "15219",
    "address_zip_check": "pass",
    "brand": "Visa",
    "country": "US",
    "customer": "cus_DtCW6oThToUnKg",
    "cvc_check": "pass",
    "dynamic_last4": null,
    "exp_month": 12,
    "exp_year": 2022,
    "fingerprint": "tiDP36QdYA6X7km8",
    "funding": "unknown",
    "last4": "1111",
    "metadata": {
    },
    "name": "Harold Hamburger",
    "tokenization_method": null
  },
  "source_transfer": null,
  "statement_descriptor": null,
  "status": "succeeded",
  "transfer_group": null
}
